MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18426/mcu.h
extern volatile T3GCONbits_t T3GCONbits __at(0x215);
// bitfield macros
#define _T3GCON_GVAL_POSN                                   0x2
#define _T3GCON_GVAL_POSITION                               0x2
#define _T3GCON_GVAL_SIZE                                   0x1
#define _T3GCON_GVAL_LENGTH                                 0x1
#define _T3GCON_GVAL_MASK                                   0x4
#define _T3GCON_GGO_POSN                                    0x3
#define _T3GCON_GGO_POSITION                                0x3
#define _T3GCON_GGO_SIZE                                    0x1
#define _T3GCON_GGO_LENGTH                                  0x1
#define _T3GCON_GGO_MASK                                    0x8
#define _T3GCON_GSPM_POSN                                   0x4
#define _T3GCON_GSPM_POSITION                               0x4
#define _T3GCON_GSPM_SIZE                                   0x1
#define _T3GCON_GSPM_LENGTH                                 0x1
#define _T3GCON_GSPM_MASK                                   0x10
#define _T3GCON_GTM_POSN                                    0x5
#define _T3GCON_GTM_POSITION                                0x5
#define _T3GCON_GTM_SIZE                                    0x1
#define _T3GCON_GTM_LENGTH                                  0x1
#define _T3GCON_GTM_MASK                                    0x20
#define _T3GCON_GPOL_POSN                                   0x6
#define _T3GCON_GPOL_POSITION                               0x6
#define _T3GCON_GPOL_SIZE                                   0x1
#define _T3GCON_GPOL_LENGTH                                 0x1
#define _T3GCON_GPOL_MASK                                   0x40
#define _T3GCON_GE_POSN                                     0x7
#define _T3GCON_GE_POSITION                                 0x7
#define _T3GCON_GE_SIZE                                     0x1
#define _T3GCON_GE_LENGTH                                   0x1
#define _T3GCON_GE_MASK                                     0x80
#define _T3GCON_T3GVAL_POSN                                 0x2
#define _T3GCON_T3GVAL_POSITION                             0x2
#define _T3GCON_T3GVAL_SIZE                                 0x1
#define _T3GCON_T3GVAL_LENGTH                               0x1
#define _T3GCON_T3GVAL_MASK                                 0x4
#define _T3GCON_T3GGO_POSN                                  0x3
#define _T3GCON_T3GGO_POSITION                              0x3
#define _T3GCON_T3GGO_SIZE                                  0x1
#define _T3GCON_T3GGO_LENGTH                                0x1
#define _T3GCON_T3GGO_MASK                                  0x8
#define _T3GCON_T3GSPM_POSN                                 0x4
#define _T3GCON_T3GSPM_POSITION                             0x4
#define _T3GCON_T3GSPM_SIZE                                 0x1
#define _T3GCON_T3GSPM_LENGTH                               0x1
#define _T3GCON_T3GSPM_MASK                                 0x10
#define _T3GCON_T3GTM_POSN                                  0x5
#define _T3GCON_T3GTM_POSITION                              0x5
#define _T3GCON_T3GTM_SIZE                                  0x1
#define _T3GCON_T3GTM_LENGTH                                0x1
#define _T3GCON_T3GTM_MASK                                  0x20
#define _T3GCON_T3GPOL_POSN                                 0x6
#define _T3GCON_T3GPOL_POSITION                             0x6
#define _T3GCON_T3GPOL_SIZE                                 0x1
#define _T3GCON_T3GPOL_LENGTH                               0x1
#define _T3GCON_T3GPOL_MASK                                 0x40
#define _T3GCON_T3GE_POSN                                   0x7
#define _T3GCON_T3GE_POSITION                               0x7
#define _T3GCON_T3GE_SIZE                                   0x1
#define _T3GCON_T3GE_LENGTH                                 0x1
#define _T3GCON_T3GE_MASK                                   0x80
#define _T3GCON_NOT_DONE_POSN                               0x3
#define _T3GCON_NOT_DONE_POSITION                           0x3
#define _T3GCON_NOT_DONE_SIZE                               0x1
#define _T3GCON_NOT_DONE_LENGTH                             0x1
#define _T3GCON_NOT_DONE_MASK                               0x8
#define _T3GCON_NOT_T3DONE_POSN                             0x3
#define _T3GCON_NOT_T3DONE_POSITION                         0x3
#define _T3GCON_NOT_T3DONE_SIZE                             0x1
#define _T3GCON_NOT_T3DONE_LENGTH                           0x1
#define _T3GCON_NOT_T3DONE_MASK                             0x8
#define _T3GCON_GGO_nDONE_POSN                              0x3
#define _T3GCON_GGO_nDONE_POSITION                          0x3
#define _T3GCON_GGO_nDONE_SIZE                              0x1
#define _T3GCON_GGO_nDONE_LENGTH                            0x1
#define _T3GCON_GGO_nDONE_MASK                              0x8
#define _T3GCON_T3GGO_nDONE_POSN                            0x3
#define _T3GCON_T3GGO_nDONE_POSITION                        0x3
#define _T3GCON_T3GGO_nDONE_SIZE                            0x1
#define _T3GCON_T3GGO_nDONE_LENGTH                          0x1
#define _T3GCON_T3GGO_nDONE_MASK                            0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO                    :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned T3GVAL                 :1;
        unsigned T3GGO                  :1;
        unsigned T3GSPM                 :1;
        unsigned T3GTM                  :1;
        unsigned T3GPOL                 :1;
        unsigned T3GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_DONE               :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_T3DONE             :1;
    };
    struct {
        unsigned                        :3;
        unsigned GGO_nDONE              :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3GGO_nDONE            :1;
    };
} TMR3GCONbits_t;
extern volatile TMR3GCONbits_t TMR3GCONbits __at(0x215);
// bitfield macros
#define _TMR3GCON_GVAL_POSN                                 0x2
#define _TMR3GCON_GVAL_POSITION                             0x2
#define _TMR3GCON_GVAL_SIZE                                 0x1
#define _TMR3GCON_GVAL_LENGTH                               0x1
#define _TMR3GCON_GVAL_MASK                                 0x4
#define _TMR3GCON_GGO_POSN                                  0x3
#define _TMR3GCON_GGO_POSITION                              0x3
#define _TMR3GCON_GGO_SIZE                                  0x1
#define _TMR3GCON_GGO_LENGTH                                0x1
#define _TMR3GCON_GGO_MASK                                  0x8
#define _TMR3GCON_GSPM_POSN                                 0x4
#define _TMR3GCON_GSPM_POSITION                             0x4
#define _TMR3GCON_GSPM_SIZE                                 0x1
#define _TMR3GCON_GSPM_LENGTH                               0x1
#define _TMR3GCON_GSPM_MASK                                 0x10
#define _TMR3GCON_GTM_POSN                                  0x5
#define _TMR3GCON_GTM_POSITION                              0x5
#define _TMR3GCON_GTM_SIZE                                  0x1
#define _TMR3GCON_GTM_LENGTH                                0x1
#define _TMR3GCON_GTM_MASK                                  0x20
#define _TMR3GCON_GPOL_POSN                                 0x6
#define _TMR3GCON_GPOL_POSITION                             0x6
#define _TMR3GCON_GPOL_SIZE                                 0x1
#define _TMR3GCON_GPOL_LENGTH                               0x1
#define _TMR3GCON_GPOL_MASK                                 0x40
#define _TMR3GCON_GE_POSN                                   0x7
#define _TMR3GCON_GE_POSITION                               0x7
#define _TMR3GCON_GE_SIZE                                   0x1
#define _TMR3GCON_GE_LENGTH                                 0x1
#define _TMR3GCON_GE_MASK                                   0x80
#define _TMR3GCON_T3GVAL_POSN                               0x2
#define _TMR3GCON_T3GVAL_POSITION                           0x2
#define _TMR3GCON_T3GVAL_SIZE                               0x1
#define _TMR3GCON_T3GVAL_LENGTH                             0x1
#define _TMR3GCON_T3GVAL_MASK                               0x4
#define _TMR3GCON_T3GGO_POSN                                0x3
#define _TMR3GCON_T3GGO_POSITION                            0x3
#define _TMR3GCON_T3GGO_SIZE                                0x1
#define _TMR3GCON_T3GGO_LENGTH                              0x1
#define _TMR3GCON_T3GGO_MASK                                0x8
#define _TMR3GCON_T3GSPM_POSN                               0x4
#define _TMR3GCON_T3GSPM_POSITION                           0x4
#define _TMR3GCON_T3GSPM_SIZE                               0x1
#define _TMR3GCON_T3GSPM_LENGTH                             0x1
#define _TMR3GCON_T3GSPM_MASK                               0x10
#define _TMR3GCON_T3GTM_POSN                                0x5
#define _TMR3GCON_T3GTM_POSITION                            0x5
#define _TMR3GCON_T3GTM_SIZE                                0x1
#define _TMR3GCON_T3GTM_LENGTH                              0x1
#define _TMR3GCON_T3GTM_MASK                                0x20
#define _TMR3GCON_T3GPOL_POSN                               0x6
#define _TMR3GCON_T3GPOL_POSITION                           0x6
#define _TMR3GCON_T3GPOL_SIZE                               0x1
#define _TMR3GCON_T3GPOL_LENGTH                             0x1
#define _TMR3GCON_T3GPOL_MASK                               0x40
#define _TMR3GCON_T3GE_POSN                                 0x7
#define _TMR3GCON_T3GE_POSITION                             0x7
#define _TMR3GCON_T3GE_SIZE                                 0x1
#define _TMR3GCON_T3GE_LENGTH                               0x1
#define _TMR3GCON_T3GE_MASK                                 0x80
#define _TMR3GCON_NOT_DONE_POSN                             0x3
#define _TMR3GCON_NOT_DONE_POSITION                         0x3
#define _TMR3GCON_NOT_DONE_SIZE                             0x1
#define _TMR3GCON_NOT_DONE_LENGTH                           0x1
#define _TMR3GCON_NOT_DONE_MASK                             0x8
#define _TMR3GCON_NOT_T3DONE_POSN                           0x3
#define _TMR3GCON_NOT_T3DONE_POSITION                       0x3
#define _TMR3GCON_NOT_T3DONE_SIZE                           0x1
#define _TMR3GCON_NOT_T3DONE_LENGTH                         0x1
#define _TMR3GCON_NOT_T3DONE_MASK                           0x8
#define _TMR3GCON_GGO_nDONE_POSN                            0x3
#define _TMR3GCON_GGO_nDONE_POSITION                        0x3
#define _TMR3GCON_GGO_nDONE_SIZE                            0x1
#define _TMR3GCON_GGO_nDONE_LENGTH                          0x1
#define _TMR3GCON_GGO_nDONE_MASK                            0x8
#define _TMR3GCON_T3GGO_nDONE_POSN                          0x3
#define _TMR3GCON_T3GGO_nDONE_POSITION                      0x3
#define _TMR3GCON_T3GGO_nDONE_SIZE                          0x1
#define _TMR3GCON_T3GGO_nDONE_LENGTH                        0x1
#define _TMR3GCON_T3GGO_nDONE_MASK                          0x8

// Register: T3GATE
#define T3GATE T3GATE
extern volatile unsigned char           T3GATE              __at(0x216);
#ifndef _LIB_BUILD
asm("T3GATE equ 0216h");
#endif
// aliases
extern volatile unsigned char           TMR3GATE            __at(0x216);
#ifndef _LIB_BUILD
asm("TMR3GATE equ 0216h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :8;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T3GSS0                 :1;
        unsigned T3GSS1                 :1;
        unsigned T3GSS2                 :1;
        unsigned T3GSS3                 :1;
        unsigned T3GSS4                 :1;
    };
} T3GATEbits_t;
