MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18426/mcu.h
// Register: SMT1PRL
#define SMT1PRL SMT1PRL
extern volatile unsigned char           SMT1PRL             __at(0x495);
#ifndef _LIB_BUILD
asm("SMT1PRL equ 0495h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned _PR0                    :1;  // Note: Changed by MikroE
        unsigned _PR1                    :1;  // Note: Changed by MikroE
        unsigned _PR2                    :1;  // Note: Changed by MikroE
        unsigned _PR3                    :1;  // Note: Changed by MikroE
        unsigned _PR4                    :1;  // Note: Changed by MikroE
        unsigned _PR5                    :1;  // Note: Changed by MikroE
        unsigned _PR6                    :1;  // Note: Changed by MikroE
        unsigned _PR7                    :1;  // Note: Changed by MikroE
    };
    struct {
        unsigned SMT1PR                 :8;
    };
    struct {
        unsigned SMT1PR0                :1;
        unsigned SMT1PR1                :1;
        unsigned SMT1PR2                :1;
        unsigned SMT1PR3                :1;
        unsigned SMT1PR4                :1;
        unsigned SMT1PR5                :1;
        unsigned SMT1PR6                :1;
        unsigned SMT1PR7                :1;
    };
} SMT1PRLbits_t;
extern volatile SMT1PRLbits_t SMT1PRLbits __at(0x495);
// bitfield macros
#define _SMT1PRL_PR_POSN                                    0x0
#define _SMT1PRL_PR_POSITION                                0x0
#define _SMT1PRL_PR_SIZE                                    0x8
#define _SMT1PRL_PR_LENGTH                                  0x8
#define _SMT1PRL_PR_MASK                                    0xFF
#define _SMT1PRL_PR0_POSN                                   0x0
#define _SMT1PRL_PR0_POSITION                               0x0
#define _SMT1PRL_PR0_SIZE                                   0x1
#define _SMT1PRL_PR0_LENGTH                                 0x1
#define _SMT1PRL_PR0_MASK                                   0x1
#define _SMT1PRL_PR1_POSN                                   0x1
#define _SMT1PRL_PR1_POSITION                               0x1
#define _SMT1PRL_PR1_SIZE                                   0x1
#define _SMT1PRL_PR1_LENGTH                                 0x1
#define _SMT1PRL_PR1_MASK                                   0x2
#define _SMT1PRL_PR2_POSN                                   0x2
#define _SMT1PRL_PR2_POSITION                               0x2
#define _SMT1PRL_PR2_SIZE                                   0x1
#define _SMT1PRL_PR2_LENGTH                                 0x1
#define _SMT1PRL_PR2_MASK                                   0x4
#define _SMT1PRL_PR3_POSN                                   0x3
#define _SMT1PRL_PR3_POSITION                               0x3
#define _SMT1PRL_PR3_SIZE                                   0x1
#define _SMT1PRL_PR3_LENGTH                                 0x1
#define _SMT1PRL_PR3_MASK                                   0x8
#define _SMT1PRL_PR4_POSN                                   0x4
#define _SMT1PRL_PR4_POSITION                               0x4
#define _SMT1PRL_PR4_SIZE                                   0x1
#define _SMT1PRL_PR4_LENGTH                                 0x1
#define _SMT1PRL_PR4_MASK                                   0x10
#define _SMT1PRL_PR5_POSN                                   0x5
#define _SMT1PRL_PR5_POSITION                               0x5
#define _SMT1PRL_PR5_SIZE                                   0x1
#define _SMT1PRL_PR5_LENGTH                                 0x1
#define _SMT1PRL_PR5_MASK                                   0x20
#define _SMT1PRL_PR6_POSN                                   0x6
#define _SMT1PRL_PR6_POSITION                               0x6
#define _SMT1PRL_PR6_SIZE                                   0x1
#define _SMT1PRL_PR6_LENGTH                                 0x1
#define _SMT1PRL_PR6_MASK                                   0x40
#define _SMT1PRL_PR7_POSN                                   0x7
#define _SMT1PRL_PR7_POSITION                               0x7
#define _SMT1PRL_PR7_SIZE                                   0x1
#define _SMT1PRL_PR7_LENGTH                                 0x1
#define _SMT1PRL_PR7_MASK                                   0x80
#define _SMT1PRL_SMT1PR_POSN                                0x0
#define _SMT1PRL_SMT1PR_POSITION                            0x0
#define _SMT1PRL_SMT1PR_SIZE                                0x8
#define _SMT1PRL_SMT1PR_LENGTH                              0x8
#define _SMT1PRL_SMT1PR_MASK                                0xFF
#define _SMT1PRL_SMT1PR0_POSN                               0x0
#define _SMT1PRL_SMT1PR0_POSITION                           0x0
#define _SMT1PRL_SMT1PR0_SIZE                               0x1
#define _SMT1PRL_SMT1PR0_LENGTH                             0x1
#define _SMT1PRL_SMT1PR0_MASK                               0x1
#define _SMT1PRL_SMT1PR1_POSN                               0x1
#define _SMT1PRL_SMT1PR1_POSITION                           0x1
#define _SMT1PRL_SMT1PR1_SIZE                               0x1
#define _SMT1PRL_SMT1PR1_LENGTH                             0x1
#define _SMT1PRL_SMT1PR1_MASK                               0x2
#define _SMT1PRL_SMT1PR2_POSN                               0x2
#define _SMT1PRL_SMT1PR2_POSITION                           0x2
#define _SMT1PRL_SMT1PR2_SIZE                               0x1
#define _SMT1PRL_SMT1PR2_LENGTH                             0x1
#define _SMT1PRL_SMT1PR2_MASK                               0x4
#define _SMT1PRL_SMT1PR3_POSN                               0x3
#define _SMT1PRL_SMT1PR3_POSITION                           0x3
#define _SMT1PRL_SMT1PR3_SIZE                               0x1
#define _SMT1PRL_SMT1PR3_LENGTH                             0x1
#define _SMT1PRL_SMT1PR3_MASK                               0x8
#define _SMT1PRL_SMT1PR4_POSN                               0x4
#define _SMT1PRL_SMT1PR4_POSITION                           0x4
#define _SMT1PRL_SMT1PR4_SIZE                               0x1
#define _SMT1PRL_SMT1PR4_LENGTH                             0x1
#define _SMT1PRL_SMT1PR4_MASK                               0x10
#define _SMT1PRL_SMT1PR5_POSN                               0x5
#define _SMT1PRL_SMT1PR5_POSITION                           0x5
#define _SMT1PRL_SMT1PR5_SIZE                               0x1
#define _SMT1PRL_SMT1PR5_LENGTH                             0x1
#define _SMT1PRL_SMT1PR5_MASK                               0x20
#define _SMT1PRL_SMT1PR6_POSN                               0x6
#define _SMT1PRL_SMT1PR6_POSITION                           0x6
#define _SMT1PRL_SMT1PR6_SIZE                               0x1
#define _SMT1PRL_SMT1PR6_LENGTH                             0x1
#define _SMT1PRL_SMT1PR6_MASK                               0x40
#define _SMT1PRL_SMT1PR7_POSN                               0x7
#define _SMT1PRL_SMT1PR7_POSITION                           0x7
#define _SMT1PRL_SMT1PR7_SIZE                               0x1
#define _SMT1PRL_SMT1PR7_LENGTH                             0x1
#define _SMT1PRL_SMT1PR7_MASK                               0x80

// Register: SMT1PRH
#define SMT1PRH SMT1PRH
extern volatile unsigned char           SMT1PRH             __at(0x496);
#ifndef _LIB_BUILD
asm("SMT1PRH equ 0496h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned _PR8                    :1;  // Note: Changed by MikroE
        unsigned _PR9                    :1;  // Note: Changed by MikroE
        unsigned PR10                   :1;
        unsigned PR11                   :1;
        unsigned PR12                   :1;
        unsigned PR13                   :1;
        unsigned PR14                   :1;
        unsigned PR15                   :1;
    };
    struct {
        unsigned SMT1PR                 :8;
    };
    struct {
        unsigned SMT1PR8                :1;
        unsigned SMT1PR9                :1;
        unsigned SMT1PR10               :1;
        unsigned SMT1PR11               :1;
        unsigned SMT1PR12               :1;
        unsigned SMT1PR13               :1;
        unsigned SMT1PR14               :1;
        unsigned SMT1PR15               :1;
    };
} SMT1PRHbits_t;
extern volatile SMT1PRHbits_t SMT1PRHbits __at(0x496);
// bitfield macros
#define _SMT1PRH_PR_POSN                                    0x0
#define _SMT1PRH_PR_POSITION                                0x0
#define _SMT1PRH_PR_SIZE                                    0x8
#define _SMT1PRH_PR_LENGTH                                  0x8
#define _SMT1PRH_PR_MASK                                    0xFF
#define _SMT1PRH_PR8_POSN                                   0x0
#define _SMT1PRH_PR8_POSITION                               0x0
#define _SMT1PRH_PR8_SIZE                                   0x1
#define _SMT1PRH_PR8_LENGTH                                 0x1
#define _SMT1PRH_PR8_MASK                                   0x1
#define _SMT1PRH_PR9_POSN                                   0x1
#define _SMT1PRH_PR9_POSITION                               0x1
#define _SMT1PRH_PR9_SIZE                                   0x1
#define _SMT1PRH_PR9_LENGTH                                 0x1
#define _SMT1PRH_PR9_MASK                                   0x2
#define _SMT1PRH_PR10_POSN                                  0x2
#define _SMT1PRH_PR10_POSITION                              0x2
#define _SMT1PRH_PR10_SIZE                                  0x1
#define _SMT1PRH_PR10_LENGTH                                0x1
#define _SMT1PRH_PR10_MASK                                  0x4
#define _SMT1PRH_PR11_POSN                                  0x3
#define _SMT1PRH_PR11_POSITION                              0x3
#define _SMT1PRH_PR11_SIZE                                  0x1
#define _SMT1PRH_PR11_LENGTH                                0x1
#define _SMT1PRH_PR11_MASK                                  0x8
#define _SMT1PRH_PR12_POSN                                  0x4
#define _SMT1PRH_PR12_POSITION                              0x4
#define _SMT1PRH_PR12_SIZE                                  0x1
#define _SMT1PRH_PR12_LENGTH                                0x1
#define _SMT1PRH_PR12_MASK                                  0x10
#define _SMT1PRH_PR13_POSN                                  0x5
#define _SMT1PRH_PR13_POSITION                              0x5
#define _SMT1PRH_PR13_SIZE                                  0x1
#define _SMT1PRH_PR13_LENGTH                                0x1
#define _SMT1PRH_PR13_MASK                                  0x20
#define _SMT1PRH_PR14_POSN                                  0x6
#define _SMT1PRH_PR14_POSITION                              0x6
#define _SMT1PRH_PR14_SIZE                                  0x1
#define _SMT1PRH_PR14_LENGTH                                0x1
#define _SMT1PRH_PR14_MASK                                  0x40
#define _SMT1PRH_PR15_POSN                                  0x7
#define _SMT1PRH_PR15_POSITION                              0x7
#define _SMT1PRH_PR15_SIZE                                  0x1
#define _SMT1PRH_PR15_LENGTH                                0x1
#define _SMT1PRH_PR15_MASK                                  0x80
#define _SMT1PRH_SMT1PR_POSN                                0x0
#define _SMT1PRH_SMT1PR_POSITION                            0x0
#define _SMT1PRH_SMT1PR_SIZE                                0x8
#define _SMT1PRH_SMT1PR_LENGTH                              0x8
#define _SMT1PRH_SMT1PR_MASK                                0xFF
#define _SMT1PRH_SMT1PR8_POSN                               0x0
#define _SMT1PRH_SMT1PR8_POSITION                           0x0
#define _SMT1PRH_SMT1PR8_SIZE                               0x1
#define _SMT1PRH_SMT1PR8_LENGTH                             0x1
#define _SMT1PRH_SMT1PR8_MASK                               0x1
#define _SMT1PRH_SMT1PR9_POSN                               0x1
#define _SMT1PRH_SMT1PR9_POSITION                           0x1
#define _SMT1PRH_SMT1PR9_SIZE                               0x1
#define _SMT1PRH_SMT1PR9_LENGTH                             0x1
#define _SMT1PRH_SMT1PR9_MASK                               0x2
#define _SMT1PRH_SMT1PR10_POSN                              0x2
#define _SMT1PRH_SMT1PR10_POSITION                          0x2
#define _SMT1PRH_SMT1PR10_SIZE                              0x1
#define _SMT1PRH_SMT1PR10_LENGTH                            0x1
#define _SMT1PRH_SMT1PR10_MASK                              0x4
#define _SMT1PRH_SMT1PR11_POSN                              0x3
#define _SMT1PRH_SMT1PR11_POSITION                          0x3
#define _SMT1PRH_SMT1PR11_SIZE                              0x1
#define _SMT1PRH_SMT1PR11_LENGTH                            0x1
#define _SMT1PRH_SMT1PR11_MASK                              0x8
#define _SMT1PRH_SMT1PR12_POSN                              0x4
#define _SMT1PRH_SMT1PR12_POSITION                          0x4
#define _SMT1PRH_SMT1PR12_SIZE                              0x1
#define _SMT1PRH_SMT1PR12_LENGTH                            0x1
#define _SMT1PRH_SMT1PR12_MASK                              0x10
#define _SMT1PRH_SMT1PR13_POSN                              0x5
#define _SMT1PRH_SMT1PR13_POSITION                          0x5
#define _SMT1PRH_SMT1PR13_SIZE                              0x1
#define _SMT1PRH_SMT1PR13_LENGTH                            0x1
#define _SMT1PRH_SMT1PR13_MASK                              0x20
#define _SMT1PRH_SMT1PR14_POSN                              0x6
#define _SMT1PRH_SMT1PR14_POSITION                          0x6
#define _SMT1PRH_SMT1PR14_SIZE                              0x1
#define _SMT1PRH_SMT1PR14_LENGTH                            0x1
#define _SMT1PRH_SMT1PR14_MASK                              0x40
#define _SMT1PRH_SMT1PR15_POSN                              0x7
#define _SMT1PRH_SMT1PR15_POSITION                          0x7
#define _SMT1PRH_SMT1PR15_SIZE                              0x1
#define _SMT1PRH_SMT1PR15_LENGTH                            0x1
#define _SMT1PRH_SMT1PR15_MASK                              0x80

